      ******************************************************************
      * Author: Ricardo Alvarenga
      * Date: 2023-09-02
      * Purpose: Teste de Ambiente
      * Tectonics: cobc
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
            DISPLAY "Hello COBOL!"
            STOP RUN.
       END PROGRAM HELLO.
