      ******************************************************************
      * Author: Ricardo Alvarenga - RRA
      * Date: 2023-09-05
      * Purpose: Estudo
      * Tectonics: cobc
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROGCOB01.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
            DISPLAY "Hello COBOL!"
            STOP RUN.
       END PROGRAM PROGCOB01.
